exempleWebService/observatoire.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:CNHJ_WS_SRV_ET">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:SendObservatoireEconomique>
         <SendObservatoireEconomiqueParam>
            <IdMessage>26</IdMessage>
            <ExternalId>1411</ExternalId>
            <Nature>SendObservatoireEconomique</Nature>
            <Date>2014-01-28</Date>
            <Heure>09:38:15</Heure>
            <Nom_Editeur>PRIAM INFORMATIQUE</Nom_Editeur>
            <Nom_Logiciel>WINPRIAM</Nom_Logiciel>
            <Licence>8AC4-4749-GGAF-G55H-B9E3</Licence>
            <Version_Logiciel>obs_vlog</Version_Logiciel>
            <Periode_Extraction></Periode_Extraction>
            <ENC_Acomptes_debiteurs>0</ENC_Acomptes_debiteurs>
            <ENC_Provisions_Dem>0</ENC_Provisions_Dem>
            <REV_Cumul>0</REV_Cumul>
            <REV_Cumul_PS>0</REV_Cumul_PS>
            <VD_Cumul>0</VD_Cumul>
            <PF_Cumul>1319</PF_Cumul>
            <PF_Honoraires_Ht>0</PF_Honoraires_Ht>
            <PF_HHT_Actes>868</PF_HHT_Actes>
            <PF_HHT_DRE_A8>0</PF_HHT_DRE_A8>
            <PF_HHT_DRE_A10>0</PF_HHT_DRE_A10>
            <PF_HHT_HC>0</PF_HHT_HC>
            <PF_HHT_FG>33</PF_HHT_FG>
            <PF_HHT_FD>0</PF_HHT_FD>
            <PF_HHT_FDF>202</PF_HHT_FDF>
            <PF_TVA>216</PF_TVA>
            <PF_TAXES_Forfaitaires>0</PF_TAXES_Forfaitaires>
            <PF_Debours>0</PF_Debours>
            <PE_Cumul>806</PE_Cumul>
            <PE_Honoraires_Ht>0</PE_Honoraires_Ht>
            <PE_HHT_Actes>439</PE_HHT_Actes>
            <PE_HHT_DRE_A8>0</PE_HHT_DRE_A8>
            <PE_HHT_DRE_A10>0</PE_HHT_DRE_A10>
            <PE_HHT_HC>0</PE_HHT_HC>
            <PE_HHT_FG>0</PE_HHT_FG>
            <PE_HHT_FD>0</PE_HHT_FD>
            <PE_HHT_FDF>235</PE_HHT_FDF>
            <PE_TVA>132</PE_TVA>
            <PE_TAXES_Forfaitaires>0</PE_TAXES_Forfaitaires>
            <PE_Debours>0</PE_Debours>
            <Cumul_Charges>0</Cumul_Charges>
            <Cumul_Charges_Constatees>0</Cumul_Charges_Constatees>
            <Cumul_Charges_Payees>0</Cumul_Charges_Payees>
            <NB_AE_ST>0</NB_AE_ST>
            <NB_AE_NST>0</NB_AE_NST>
            <NB_AE_AJ>0</NB_AE_AJ>
            <NB_AD_ST>0</NB_AD_ST>
            <NB_AD_NST>0</NB_AD_NST>
            <NB_AD_AJ>0</NB_AD_AJ>
            <NB_AP>0</NB_AP>
         </SendObservatoireEconomiqueParam>
      </urn:SendObservatoireEconomique>
   </soapenv:Body>
</soapenv:Envelope>